### 为什么学习pandas
- numpy已经可以帮助我们进行数据的处理了，那么学习pandas的目的是什么呢？
    - numpy能够帮助我们处理的是数值型的数据，当然在数据分析中除了数值型的数据还有好多其他类型的数据（字符串，时间序列），那么pandas就可以帮我们很好的处理除了数值型的其他数据！

### 什么是pandas？
- 首先先来认识pandas中的两个常用的类
    - Series
    - DataFrame

### Series
- Series是一种类似与一维数组的对象，由下面两个部分组成：
    - values：一组数据（ndarray类型）
    - index：相关的数据索引标签

- Series的创建
    - 由列表或numpy数组创建
    - 由字典创建

In [2]:
from pandas import Series
s = Series(data=[1,2,3,4])
s

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
import numpy as np
s = Series(data=np.random.randint(0,100,size=(3,)))
s

0    44
1    82
2    96
dtype: int32

In [5]:
#index用来指定显示索引
s = Series(data=[1,2,3,'four'],index=['a','b','c','d'])
s

a       1
b       2
c       3
d    four
dtype: object

为什么需要有显示索引？

显示索引可以增强Series的可读性

In [8]:
dic = {
    '语文':100,
    '数学':99,
    '理综':250
}
s = Series(data=dic)
s

语文    100
数学     99
理综    250
dtype: int64

- Series的索引和切片

In [13]:
type(s[0])

numpy.int64

In [10]:
s.语文

100

In [14]:
type(s[0:1])

pandas.core.series.Series

- Series的常用属性
    - shape
    - size
    - index
    - values

In [15]:
s.shape

(3,)

In [16]:
s.size

3

In [17]:
s.index #返回索引

Index(['语文', '数学', '理综'], dtype='object')

In [18]:
s.values #返回值

array([100,  99, 250], dtype=int64)

In [19]:
s.dtype #元素的类型

dtype('int64')

In [20]:
s = Series(data=[1,2,3,'four'],index=['a','b','c','d'])
s.dtype #数据类型O表示的是Object（字符串类型）

dtype('O')

- Series的常用方法
    - head(),tail()
    - unique()
    - isnull(),notnull()
    - add() sub() mul() div()

In [24]:
s = Series(data=np.random.randint(60,100,size=(10,)))
s.head() #显示前n个数据

0    60
1    79
2    84
3    77
4    94
dtype: int32

In [26]:
s.tail() #显示后n个元素

5    82
6    94
7    60
8    87
9    97
dtype: int32

In [27]:
s.unique() #去重

array([60, 79, 84, 77, 94, 82, 87, 97])

In [28]:
s.isnull() #用于判断每一个元素是否为空，为空返回True，否则返回False

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [ ]:
s.notnull()

- Series的算术运算
    - 法则：索引一致的元素进行算数运算否则补空

In [31]:
s1 = Series(data=[1,2,3],index=['a','b','c'])
s2 = Series(data=[1,2,3],index=['a','d','c'])
s = s1 * s2
s

a    1.0
b    NaN
c    9.0
d    NaN
dtype: float64

In [32]:
s.isnull()

a    False
b     True
c    False
d     True
dtype: bool

### DataFrame
- DataFrame是一个【表格型】的数据结构。DataFrame由按一定顺序排列的多列数据组成。设计初衷是将Series的使用场景从一维拓展到多维。DataFrame既有行索引，也有列索引。
    - 行索引：index
    - 列索引：columns
    - 值：values

- DataFrame的创建
    - ndarray创建
    - 字典创建

In [33]:
from pandas import DataFrame

In [34]:
df = DataFrame(data=[[1,2,3],[4,5,6]])
df

   0  1  2
0  1  2  3
1  4  5  6

In [38]:
df = DataFrame(data=np.random.randint(0,100,size=(6,4)))
df

    0   1   2   3
0  36   0  20  17
1  42  38  69  91
2  91  24  12  93
3  20   8  43  87
4  12  42  78  25
5  41  15   7   3

In [39]:
dic = {
    'name':['zhangsan','lisi','wanglaowu'],
    'salary':[1000,2000,3000]
}
df = DataFrame(data=dic,index=['a','b','c'])
df

        name  salary
a   zhangsan    1000
b       lisi    2000
c  wanglaowu    3000

- DataFrame的属性
    - values、columns、index、shape

In [40]:
df.values

array([['zhangsan', 1000],
       ['lisi', 2000],
       ['wanglaowu', 3000]], dtype=object)

In [41]:
df.columns

Index(['name', 'salary'], dtype='object')

In [42]:
df.index

Index(['a', 'b', 'c'], dtype='object')

In [44]:
df.size

6

============================================

练习4：

根据以下考试成绩表，创建一个DataFrame，命名为df：
```
    张三  李四  
语文 150  0
数学 150  0
英语 150  0
理综 300  0
```

============================================

In [45]:
dic = {
    '张三':[150,150,150,150],
    '李四':[0,0,0,0]
}
df = DataFrame(data=dic,index=['语文','数学','英语','理综'])
df

     张三  李四
语文  150   0
数学  150   0
英语  150   0
理综  150   0

- DataFrame索引操作
    - 对行进行索引
    - 队列进行索引
    - 对元素进行索引

In [48]:
df = DataFrame(data=np.random.randint(60,100,size=(8,4)),columns=['a','b','c','d'])
df

    a   b   c   d
0  79  95  90  91
1  68  66  63  78
2  85  89  98  70
3  69  74  73  79
4  65  96  62  93
5  79  83  64  82
6  92  99  82  84
7  77  77  63  94

In [53]:
df['a'] #取单列，如果df有显示的索引，通过索引机制去行或者列的时候只可以使用显示索引
# type(df['a'])

0    79
1    68
2    85
3    69
4    65
5    79
6    92
7    77
Name: a, dtype: int32

In [51]:
df[['a','c']] #取多列

    a   c
0  79  90
1  68  63
2  85  98
3  69  73
4  65  62
5  79  64
6  92  82
7  77  63

- iloc:
    - 通过隐式索引取行
- loc:
    - 通过显示索引取行

In [63]:
#取单行
df.loc[0]

a    79
b    95
c    90
d    91
Name: 0, dtype: int32

In [54]:
#取多行
df.iloc[[0,3,5]]

    a   b   c   d
0  79  95  90  91
3  69  74  73  79
5  79  83  64  82

In [55]:
#取单个元素
df.iloc[0,2]

90

In [56]:
#取单个元素
df.loc[0,'a']

79

In [57]:
#取多个元素
df.iloc[[1,3,5],2]

1    63
3    73
5    64
Name: c, dtype: int32

- DataFrame的切片操作
    - 对行进行切片
    - 对列进行切片

In [65]:
#切行
df[0:2]

    a   b   c   d
0  79  95  90  91
1  68  66  63  78

In [69]:
#切列
df.iloc[:,0:2]

    a   b
0  79  95
1  68  66
2  85  89
3  69  74
4  65  96
5  79  83
6  92  99
7  77  77

- df索引和切片操作
    - 索引：
        - df[col]:取列
        - df.loc[index]:取行
        - df.iloc[index,col]:取元素
    - 切片：
        - df[index1:index3]:切行
        - df.iloc[:,col1:col3]:切列

- DataFrame的运算
    - 同Series

============================================

练习：

1. 假设ddd是期中考试成绩，ddd2是期末考试成绩，请自由创建ddd2，并将其与ddd相加，求期中期末平均值。

2. 假设张三期中考试数学被发现作弊，要记为0分，如何实现？

3. 李四因为举报张三作弊立功，期中考试所有科目加100分，如何实现？

4. 后来老师发现有一道题出错了，为了安抚学生情绪，给每位学生每个科目都加10分，如何实现？

============================================

In [75]:
dic = {
    '张三':[130,100,110,120],
    '李四':[0,0,0,0]
}
df = DataFrame(data=dic,index=['语文','数学','英语','理综'])
qizhong = df
qimo = df + 20
qimo

     张三  李四
语文  150  20
数学  120  20
英语  130  20
理综  140  20

In [77]:
(qizhong + qimo) / 2 #期中期末的平均值

       张三    李四
语文  140.0  10.0
数学  110.0  10.0
英语  120.0  10.0
理综  130.0  10.0

In [78]:
qizhong.loc['数学','张三'] = 0
qizhong #将张三的数学成绩修改为0

     张三  李四
语文  130   0
数学    0   0
英语  110   0
理综  120   0

In [79]:
#将李四的所有成绩+100
qizhong['李四']+=100
qizhong

     张三   李四
语文  130  100
数学    0  100
英语  110  100
理综  120  100

In [87]:
qizhong.iloc[1] += 10
qizhong #将所有学生的成绩+10

     张三   李四
语文  140  110
数学   40  140
英语  120  110
理综  130  110

- 时间数据类型的转换
    - pd.to_datetime(col)
- 将某一列设置为行索引
    - df.set_index()

In [88]:
dic = {
    'time':['2010-10-10','2011-11-20','2020-01-10'],
    'temp':[33,31,30]
}
df = DataFrame(data=dic)
df

         time  temp
0  2010-10-10    33
1  2011-11-20    31
2  2020-01-10    30

In [89]:
#查看time列的类型
df['time'].dtype

dtype('O')

In [90]:
import pandas as pd

In [91]:
#将time列的数据类型转换成时间序列类型
df['time'] = pd.to_datetime(df['time'])
df

        time  temp
0 2010-10-10    33
1 2011-11-20    31
2 2020-01-10    30

In [92]:
df['time']

0   2010-10-10
1   2011-11-20
2   2020-01-10
Name: time, dtype: datetime64[ns]

In [93]:
#将time列作为源数据的行索引
df.set_index('time',inplace=True)

In [94]:
df

            temp
time
2010-10-10    33
2011-11-20    31
2020-01-10    30

In [124]:
df = pd.Series(['2022','2022-01','2022-01-01','2022/03/01','2022/05/01 01:01:01','01 Jun 2022','05-02-22',1398902400000000000])
df

0                   2022
1                2022-01
2             2022-01-01
3             2022/03/01
4    2022/05/01 01:01:01
5            01 Jun 2022
6               05-02-22
7    1398902400000000000
dtype: object

In [125]:
dates = pd.to_datetime(df)
dates

0   2022-01-01 00:00:00
1   2022-01-01 00:00:00
2   2022-01-01 00:00:00
3   2022-03-01 00:00:00
4   2022-05-01 01:01:01
5   2022-06-01 00:00:00
6   2022-05-02 00:00:00
7   2014-05-01 00:00:00
dtype: datetime64[ns]

In [142]:
df = pd.Series(['2022年5月1日'])
df

0    2022年5月1日
dtype: object

In [147]:
date1 = pd.to_datetime(df,format='%Y年%m月%d日')
date1.dt.dayofyear

0    121
dtype: int64